cases/interFoam/S03/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    freeSurface
    {
        type            zeroGradient;
    }

    rightWall
    {
        type            fixedNormalSlip;
        n               (-1 0 0);
    }

    leftWall
    {

    type            timeVaryingUniformFixedValue;
    file "waveMakerS03.csv"; // Example file containing time vs. displacement data
    outOfBounds     clamp; // or 'repeat' for cyclic motion
    value           uniform (0 0 0); // Initial displacement

    }

    bottomWall
    {
        type            zeroGradient;
    }



    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
