cases/interFoam/S03/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (fvMotionSolvers);

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         12;

deltaT          0.01;

writeControl    adjustable;

writeInterval   12;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.03125;
maxAlphaCo      0.03125;

maxDeltaT       0.1;

functions
{


interfaceHeight1
{
    // Mandatory entries (unmodifiable)
    type            interfaceHeight;
    libs            (fieldFunctionObjects);

    // Mandatory entries (runtime modifiable)
    locations       ((-1.8 0 0) (-0.6 0 0) (0.6 0 0));

    // Optional entries (runtime modifiable)
    alpha           alpha.water;
    liquid          true;
    direction       (0 1 0);
    interpolationScheme    cellPoint;

    // Optional (inherited) entries
    writePrecision  8;
    writeToFile     true;
    useUserTime     true;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         1000;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    timeStep;
    writeInterval   1;
}
   
};


// ************************************************************************* //
