cases/interFoam/S03/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0

);

regions
(
    boxToCell
    {
        box ( -1000 -1000 -1000 ) ( 1000 0 1000);
 	//box ( -100 -100 -100 ) ( 100 100 0);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }


);

// ************************************************************************* //
